Autodesk.Revit.DB.Structure.LoadBase.IsValidReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.LoadType,System.Boolean)
Indicates if the provided reference can host a load.
doc:
The document containing both the host and the load.
reference:
A reference to a analytical element.
type:
The type of the load that is about to be hosted.
isConstrainedOnHost:
A value indicating if the load is constrained on host or not.
Returns:
True if a load can be placed on the input host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.LoadBase.RemoveHostConstraint
Removes constraint from host for this load.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
the Load is an AreaLoad and the host is an Analytical Panel with curved profile.
Since:
2024

Autodesk.Revit.DB.Structure.LoadBase.IsHosted
Indicates if the Load is hosted or non-hosted.
Remarks:
True is returned when load is hosted. False is returned load is non-hosted.
To determine if load is hosted Autodesk.Revit.DB.Structure.LoadBase.HostElementId property.
Since:
2016